## Terraform Summary

| Step                         | Result  |
|:-----------------------------|:-------:|
| 🖌  Terraform Format & Style | ✅ |
| ⚙️  Terraform Initialization | ✅ |
| 🤖  Terraform Validation     | ✅ |
| 📖  Terraform Plan           | ✅ |

### Output

<details>
<summary>Validation Output</summary>

```
Success! The configuration is valid.


```

</details>

<details>
<summary>Plan Output</summary>

```diff

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.download_grants_gov_db.module.lambda_function.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "grants_ingest-staging-DownloadGrantsGovDB"
      ~ last_modified                  = "2023-04-01T02:05:09.000+0000" -> (known after apply)
      ~ qualified_arn                  = "arn:aws:lambda:us-west-2:357150818708:function:grants_ingest-staging-DownloadGrantsGovDB:3" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-west-2:lambda:path/2015-03-31/functions/arn:aws:lambda:us-west-2:357150818708:function:grants_ingest-staging-DownloadGrantsGovDB:3/invocations" -> (known after apply)
      ~ s3_key                         = "builds/f97293dffef695cab655eeecc664e8c34c164ae0090612444da3fe68c81ec174.zip" -> "builds/331c6d5968ecea41ec4d571b5fadb577f098765e923c06c27cc75c6e29205c63.zip"
      ~ s3_object_version              = "9uHcQ_fjZI0LxcvFT.6i5876XlR8ArnM" -> (known after apply)
        tags                           = {}
      ~ version                        = "3" -> (known after apply)
        # (23 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              ~ "DD_VERSION"                     = "9253eef759c6c58f46e3ac0e274052c3c2422bb9" -> "93b21fe26a06492393372654c5fcf5974b07ba01"
                # (12 unchanged elements hidden)
            }
        }

        # (2 unchanged blocks hidden)
    }

  # module.download_grants_gov_db.module.lambda_function.aws_lambda_permission.current_version_triggers["Schedule"] must be replaced
-/+ resource "aws_lambda_permission" "current_version_triggers" {
      ~ id                  = "Schedule" -> (known after apply)
      ~ qualifier           = "3" -> (known after apply) # forces replacement
+       statement_id_prefix = (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.download_grants_gov_db.module.lambda_function.aws_s3_object.lambda_package[0] must be replaced
-/+ resource "aws_s3_object" "lambda_package" {
      ~ bucket_key_enabled     = false -> (known after apply)
      ~ content_type           = "binary/octet-stream" -> (known after apply)
      ~ etag                   = "2a4ad686b16d5f608f8e64d7405b0a8a-2" -> (known after apply)
      ~ id                     = "builds/f97293dffef695cab655eeecc664e8c34c164ae0090612444da3fe68c81ec174.zip" -> (known after apply)
      ~ key                    = "builds/f97293dffef695cab655eeecc664e8c34c164ae0090612444da3fe68c81ec174.zip" -> "builds/331c6d5968ecea41ec4d571b5fadb577f098765e923c06c27cc75c6e29205c63.zip" # forces replacement
+       kms_key_id             = (known after apply)
-       metadata               = {} -> null
      ~ source                 = "builds/f97293dffef695cab655eeecc664e8c34c164ae0090612444da3fe68c81ec174.zip" -> "builds/331c6d5968ecea41ec4d571b5fadb577f098765e923c06c27cc75c6e29205c63.zip"
-       tags                   = {} -> null
      ~ version_id             = "9uHcQ_fjZI0LxcvFT.6i5876XlR8ArnM" -> (known after apply)
        # (6 unchanged attributes hidden)
    }

  # module.download_grants_gov_db.module.lambda_function.local_file.archive_plan[0] will be created
+   resource "local_file" "archive_plan" {
+       content              = jsonencode(
            {
+               artifacts_dir = "builds"
+               build_plan    = [
+                   [
+                       "sh",
+                       "..",
+                       <<-EOT
                            task build-download_grants_gov_db
                            cd bin/download_grants_gov_db
                        EOT,
                    ],
+                   [
+                       "zip:embedded",
+                       "..",
+                       null,
                    ],
                ]
+               filename      = "builds/331c6d5968ecea41ec4d571b5fadb577f098765e923c06c27cc75c6e29205c63.zip"
+               runtime       = "provided.al2"
            }
        )
+       content_base64sha256 = (known after apply)
+       content_base64sha512 = (known after apply)
+       content_md5          = (known after apply)
+       content_sha1         = (known after apply)
+       content_sha256       = (known after apply)
+       content_sha512       = (known after apply)
+       directory_permission = "0755"
+       file_permission      = "0644"
+       filename             = "builds/331c6d5968ecea41ec4d571b5fadb577f098765e923c06c27cc75c6e29205c63.plan.json"
+       id                   = (known after apply)
    }

  # module.download_grants_gov_db.module.lambda_function.null_resource.archive[0] must be replaced
-/+ resource "null_resource" "archive" {
      ~ id       = "2283001504856102766" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "filename"  = "builds/f97293dffef695cab655eeecc664e8c34c164ae0090612444da3fe68c81ec174.zip" -> "builds/331c6d5968ecea41ec4d571b5fadb577f098765e923c06c27cc75c6e29205c63.zip"
          ~ "timestamp" = "1680314673201088000" -> "1680589308915060000"
        }
    }

  # module.download_grants_gov_db.module.lambda_function.null_resource.sam_metadata_aws_lambda_function[0] must be replaced
-/+ resource "null_resource" "sam_metadata_aws_lambda_function" {
      ~ id       = "1021931342575273674" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "built_output_path"    = "builds/f97293dffef695cab655eeecc664e8c34c164ae0090612444da3fe68c81ec174.zip" -> "builds/331c6d5968ecea41ec4d571b5fadb577f098765e923c06c27cc75c6e29205c63.zip"
            # (4 unchanged elements hidden)
        }
    }

  # module.split_grants_gov_db.module.lambda_function.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "grants_ingest-staging-SplitGrantsGovXMLDB"
      ~ last_modified                  = "2023-04-01T02:05:09.000+0000" -> (known after apply)
      ~ qualified_arn                  = "arn:aws:lambda:us-west-2:357150818708:function:grants_ingest-staging-SplitGrantsGovXMLDB:2" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-west-2:lambda:path/2015-03-31/functions/arn:aws:lambda:us-west-2:357150818708:function:grants_ingest-staging-SplitGrantsGovXMLDB:2/invocations" -> (known after apply)
      ~ s3_key                         = "builds/23a0e37147c3e3a7d65600e39737789ef9477bc0d50364e9cd436ee963610200.zip" -> "builds/10b0795d8cd652b586423e7e2d9ea6924322365d18fb8610e8c7fef92bee7982.zip"
      ~ s3_object_version              = "nG2IPek9QPAj5cimCiqmr.YELYj6pgJA" -> (known after apply)
        tags                           = {}
      ~ version                        = "2" -> (known after apply)
        # (23 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              ~ "DD_VERSION"                       = "9253eef759c6c58f46e3ac0e274052c3c2422bb9" -> "93b21fe26a06492393372654c5fcf5974b07ba01"
                # (16 unchanged elements hidden)
            }
        }

        # (2 unchanged blocks hidden)
    }

  # module.split_grants_gov_db.module.lambda_function.aws_lambda_permission.current_version_triggers["S3BucketNotification"] must be replaced
-/+ resource "aws_lambda_permission" "current_version_triggers" {
      ~ id                  = "S3BucketNotification" -> (known after apply)
      ~ qualifier           = "2" -> (known after apply) # forces replacement
+       statement_id_prefix = (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.split_grants_gov_db.module.lambda_function.aws_s3_object.lambda_package[0] must be replaced
-/+ resource "aws_s3_object" "lambda_package" {
      ~ bucket_key_enabled     = false -> (known after apply)
      ~ content_type           = "binary/octet-stream" -> (known after apply)
      ~ etag                   = "74a4a7227d3719b1ae308859e5a7c658-2" -> (known after apply)
      ~ id                     = "builds/23a0e37147c3e3a7d65600e39737789ef9477bc0d50364e9cd436ee963610200.zip" -> (known after apply)
      ~ key                    = "builds/23a0e37147c3e3a7d65600e39737789ef9477bc0d50364e9cd436ee963610200.zip" -> "builds/10b0795d8cd652b586423e7e2d9ea6924322365d18fb8610e8c7fef92bee7982.zip" # forces replacement
+       kms_key_id             = (known after apply)
-       metadata               = {} -> null
      ~ source                 = "builds/23a0e37147c3e3a7d65600e39737789ef9477bc0d50364e9cd436ee963610200.zip" -> "builds/10b0795d8cd652b586423e7e2d9ea6924322365d18fb8610e8c7fef92bee7982.zip"
-       tags                   = {} -> null
      ~ version_id             = "nG2IPek9QPAj5cimCiqmr.YELYj6pgJA" -> (known after apply)
        # (6 unchanged attributes hidden)
    }

  # module.split_grants_gov_db.module.lambda_function.local_file.archive_plan[0] will be created
+   resource "local_file" "archive_plan" {
+       content              = jsonencode(
            {
+               artifacts_dir = "builds"
+               build_plan    = [
+                   [
+                       "sh",
+                       "..",
+                       <<-EOT
                            task build-split_grants_gov_xml_db
                            cd bin/split_grants_gov_xml_db
                        EOT,
                    ],
+                   [
+                       "zip:embedded",
+                       "..",
+                       null,
                    ],
                ]
+               filename      = "builds/10b0795d8cd652b586423e7e2d9ea6924322365d18fb8610e8c7fef92bee7982.zip"
+               runtime       = "provided.al2"
            }
        )
+       content_base64sha256 = (known after apply)
+       content_base64sha512 = (known after apply)
+       content_md5          = (known after apply)
+       content_sha1         = (known after apply)
+       content_sha256       = (known after apply)
+       content_sha512       = (known after apply)
+       directory_permission = "0755"
+       file_permission      = "0644"
+       filename             = "builds/10b0795d8cd652b586423e7e2d9ea6924322365d18fb8610e8c7fef92bee7982.plan.json"
+       id                   = (known after apply)
    }

  # module.split_grants_gov_db.module.lambda_function.null_resource.archive[0] must be replaced
-/+ resource "null_resource" "archive" {
      ~ id       = "4077147972819913241" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "filename"  = "builds/23a0e37147c3e3a7d65600e39737789ef9477bc0d50364e9cd436ee963610200.zip" -> "builds/10b0795d8cd652b586423e7e2d9ea6924322365d18fb8610e8c7fef92bee7982.zip"
          ~ "timestamp" = "1680314673227884000" -> "1680589308801354800"
        }
    }

  # module.split_grants_gov_db.module.lambda_function.null_resource.sam_metadata_aws_lambda_function[0] must be replaced
-/+ resource "null_resource" "sam_metadata_aws_lambda_function" {
      ~ id       = "1602254871386549882" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "built_output_path"    = "builds/23a0e37147c3e3a7d65600e39737789ef9477bc0d50364e9cd436ee963610200.zip" -> "builds/10b0795d8cd652b586423e7e2d9ea6924322365d18fb8610e8c7fef92bee7982.zip"
            # (4 unchanged elements hidden)
        }
    }

Plan: 10 to add, 2 to change, 8 to destroy.
```

</details>

*Pusher: @TylerHendrickson, Action: `pull_request`, Workflow: [`Continuous Integration`](https://github.com/usdigitalresponse/grants-ingest/actions/runs/4604642987)*